<a href="https://colab.research.google.com/github/elvissounna/Projet_IA/blob/main/week_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
from google.colab import drive
drive.mount("/content/drive")

Mounted at /content/drive

In [ ]:
import os
import pandas as pd
import numpy as np
import matplotlib_inline
import matplotlib.pyplot as plt
os.chdir("/content/drive/MyDrive/DataSets/DataSets")

In [ ]:
#Visualization and analysis of Cab_Data file.
cab = pd.read_csv("Cab_Data.csv")
cab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  int64
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(2), object(2)
memory usage: 19.2+ MB

In [ ]:
#Affichons les premières lignes du DataSet ainsi que sa taille
print(cab.head(30))
print(cab.shape)

In [ ]:
# Visualisons le nombre de données manquantes pour chaque variable
cab.isna().sum()

Transaction ID    0
Date of Travel    0
Company           0
City              0
KM Travelled      0
Price Charged     0
Cost of Trip      0
dtype: int64

In [ ]:
print(cab["Date of Travel"].dtypes)
# On peut remarquer que le format n'est pas celui indiqué pour indiquer la date.
# Nous allons donc le convertir

object

In [ ]:
# revisualisons le dataset
print(cab['Date of Travel'])

0         42377
1         42375
2         42371
3         42376
4         42372
          ...
359387    43108
359388    43104
359389    43105
359390    43105
359391    43102
Name: Date of Travel, Length: 359392, dtype: int64

In [ ]:
# Convertissons la date en format date.

In [ ]:
from datetime import datetime, timedelta

In [ ]:
def to_date_format(n):
    date_str =(datetime(1899,12,30) + timedelta(n-1)).strftime("%d-%m-%Y")
    date_date =  datetime.strptime(date_str, "%d-%m-%Y")
    return date_date

In [ ]:
cab['Date of Travel']=cab['Date of Travel'].apply(lambda x:to_date_format(x))

In [ ]:
cab.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,2016-01-07,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,2016-01-05,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,2016-01-01,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,2016-01-06,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,2016-01-02,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [ ]:
# On peut classifier notre data set en fonction de la date par ordre croissant

In [ ]:
cab = cab.sort_values(by = ['Date of Travel'])

cab = cab.reset_index(drop = True )

print(cab.shape)
cab.head(10)

(359392, 7)

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10001340,2016-01-01,Yellow Cab,WASHINGTON DC,10.20,202.54,135.8640
1,10001373,2016-01-01,Yellow Cab,WASHINGTON DC,18.08,392.04,216.9600
2,10000927,2016-01-01,Yellow Cab,NEW YORK NY,34.56,1121.11,485.2224
3,10000832,2016-01-01,Yellow Cab,NEW YORK NY,29.29,907.43,369.0540
4,10000771,2016-01-01,Yellow Cab,LOS ANGELES CA,1.92,45.47,27.1872
5,10000939,2016-01-01,Yellow Cab,NEW YORK NY,41.07,1275.54,591.4080
6,10000837,2016-01-01,Yellow Cab,NEW YORK NY,4.80,139.76,61.0560
7,10001378,2016-01-01,Yellow Cab,WASHINGTON DC,5.25,115.74,69.9300
8,10000843,2016-01-01,Yellow Cab,NEW YORK NY,5.45,175.87,69.3240
9,10000775,2016-01-01,Yellow Cab,LOS ANGELES CA,29.87,733.78,430.1280

In [ ]:
# On peut faire une visions statistique élémentaire globale sur notre jeu de données avec la fonction roun pour plus joli
round(cab.describe(include = 'all'),2)

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
count,359392.00,359392,359392,359392,359392.00,359392.00,359392.00
unique,NaN,1095,2,19,NaN,NaN,NaN
top,NaN,2018-01-04 00:00:00,Yellow Cab,NEW YORK NY,NaN,NaN,NaN
freq,NaN,2022,274681,99885,NaN,NaN,NaN
first,NaN,2016-01-01 00:00:00,NaN,NaN,NaN,NaN,NaN
last,NaN,2018-12-30 00:00:00,NaN,NaN,NaN,NaN,NaN
mean,10220761.19,NaN,NaN,NaN,22.57,423.44,286.19
std,126805.80,NaN,NaN,NaN,12.23,274.38,157.99
min,10000011.00,NaN,NaN,NaN,1.90,15.60,19.00
25%,10110809.75,NaN,NaN,NaN,12.00,206.44,151.20
50%,10221035.50,NaN,NaN,NaN,22.44,386.36,282.48
75%,10330937.25,NaN,NaN,NaN,32.96,583.66,413.68
max,10440107.00,NaN,NaN,NaN,48.00,2048.03,691.20

In [ ]:
#Visualisation of City.csv file

In [ ]:
city = pd.read_csv("City.csv")
print(city.info())
print(city.shape)
city.head(15)
city.dtypes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes
None
(20, 3)

City          object
Population    object
Users         object
dtype: object

In [ ]:
# On remarque la présence des virgules entre les valeurs des variables Population et Users.
# Pour cela nous allons les transormer en float afin de ne pas avoir d'ennuie lors de l'élaboration des calculs statistiques

In [ ]:
city['Population'] = [x.replace(',','') for x in city['Population']]
city['Users'] = [x.replace(',','') for x in city['Users']]
city['Population'] = city['Population'].astype(float)
city['Users'] = city['Users'].astype(float)

In [ ]:
# On peut maintenant vérifier si le type a effectivement changer
city.dtypes

City           object
Population    float64
Users         float64
dtype: object

In [ ]:
#Visualisation and analysis of Customer_ID.csv

In [ ]:
customer = pd.read_csv("Customer_ID.csv")
print(customer.head(15))

    Customer ID Gender  Age  Income (USD/Month)
0         29290   Male   28               10813
1         27703   Male   27                9237
2         28712   Male   53               11242
3         28020   Male   23               23327
4         27182   Male   33                8536
5         27318   Male   25               13984
6         33788   Male   23               23788
7         34106   Male   19               19980
8         59799   Male   33               19271
9         57982   Male   57                5068
10        58774   Male   20               23602
11        58627   Male   28               27338
12        59007   Male   63                6683
13        58215   Male   25                6862
14        59372   Male   53                4912

In [ ]:
# Visualisation and analysis of Trnsaction_ID.csv file

In [ ]:
transaction = pd.read_csv("Transaction_ID.csv")
print(transaction.head(15))
print(transaction.shape)

    Transaction ID  Customer ID Payment_Mode
0         10000011        29290         Card
1         10000012        27703         Card
2         10000013        28712         Cash
3         10000014        28020         Cash
4         10000015        27182         Card
5         10000016        27318         Cash
6         10000017        33788         Card
7         10000018        34106         Card
8         10000019        59799         Cash
9         10000020        57982         Cash
10        10000021        58774         Cash
11        10000022        58627         Card
12        10000023        59007         Card
13        10000024        58215         Cash
14        10000025        59372         Cash
(440098, 3)

In [ ]:
#transaction['Payment_Mode']
cash = transaction.loc[transaction['Payment_Mode'] == "Cash"]
print(cash.head())
print(cash.shape)

   Transaction ID  Customer ID Payment_Mode
2        10000013        28712         Cash
3        10000014        28020         Cash
5        10000016        27318         Cash
8        10000019        59799         Cash
9        10000020        57982         Cash
(176107, 3)

In [ ]:
440098-176107

263991